devdnl/dnx-rtos/src/system/drivers/uart/stm32fx/uart_lld.c
        if (_UART_mem[major]->config.basic.mode == UART_MODE__RS485) {
                _UART_set_DE_pin(_UART_mem[major], true);
        }

        SET_BIT(UART[major].UART->CR1, USART_CR1_TCIE);

        sys_critical_section_end();
}

//==============================================================================
/**
 * @brief Function abort pending transmission.
 *
 * @param major         UART number
 */
//==============================================================================
void _UART_LLD__abort_trasmission(u8_t major)
{
        sys_critical_section_begin();

        CLEAR_BIT(UART[major].UART->CR1, USART_CR1_TCIE);

        if (_UART_mem[major]->config.basic.mode == UART_MODE__RS485) {
                _UART_set_DE_pin(_UART_mem[major], false);
        }

        sys_critical_section_end();
}

//==============================================================================
/**
 * @brief Function resume byte receiving.
 *
 * @param major         UART number
 */
//==============================================================================
void _UART_LLD__rx_resume(u8_t major)
{
        sys_critical_section_begin();
        SET_BIT(UART[major].UART->CR1, USART_CR1_RXNEIE);
        sys_critical_section_end();
}

//==============================================================================
/**
 * @brief Function hold byte receiving.
 *
 * @param major         UART number
 */
//==============================================================================
void _UART_LLD__rx_hold(u8_t major)
{
        sys_critical_section_begin();
        CLEAR_BIT(UART[major].UART->CR1, USART_CR1_RXNEIE);
        sys_critical_section_end();
}

//==============================================================================
/**
 * @brief Function configure selected UART.
 *
 * @param major         major device number
 * @param config        configuration structure
 */
//==============================================================================
int _UART_LLD__configure(u8_t major, const struct UART_rich_config *config)
{
        const UART_regs_t *DEV = &UART[major];
        u32_t PCLK = 0;

        /* set baud */
#if defined(ARCH_stm32f1) || defined(ARCH_stm32f4)
        LL_RCC_ClocksTypeDef freq;
        LL_RCC_GetSystemClocksFreq(&freq);

        switch (DEV->CLKSRC) {
        case USART_CLKSOURCE_PCLK1:
                PCLK = freq.PCLK1_Frequency;
                break;

        case USART_CLKSOURCE_PCLK2:
                PCLK = freq.PCLK2_Frequency;
                break;
        default:
                printk("UART: invalid CLKSRC!");
                break;
        }
#elif defined(ARCH_stm32f7) || defined(ARCH_stm32f3)
        switch (DEV->CLKSRC) {
        #if defined(LL_RCC_USART1_CLKSOURCE)
        case LL_RCC_USART1_CLKSOURCE:
        #endif
        #if defined(LL_RCC_USART2_CLKSOURCE)
        case LL_RCC_USART2_CLKSOURCE:
        #endif
        #if defined(LL_RCC_USART3_CLKSOURCE)
        case LL_RCC_USART3_CLKSOURCE:
        #endif
        #if defined(LL_RCC_USART6_CLKSOURCE)
        case LL_RCC_USART6_CLKSOURCE:
        #endif
                PCLK = LL_RCC_GetUSARTClockFreq(DEV->CLKSRC);
                break;
        #if defined(LL_RCC_UART4_CLKSOURCE)
        case LL_RCC_UART4_CLKSOURCE:
        #endif
        #if defined(LL_RCC_UART5_CLKSOURCE)
        case LL_RCC_UART5_CLKSOURCE:
        #endif
        #if defined(LL_RCC_UART7_CLKSOURCE)
        case LL_RCC_UART7_CLKSOURCE:
        #endif
        #if defined(LL_RCC_UART8_CLKSOURCE)
        case LL_RCC_UART8_CLKSOURCE:
        #endif
                PCLK = LL_RCC_GetUARTClockFreq(DEV->CLKSRC);
                break;

        default:
                break;
        }
#elif defined(ARCH_stm32h7)
        PCLK = LL_RCC_GetUSARTClockFreq(DEV->CLKSRC);
#endif

        DEV->UART->BRR = (PCLK / (config->basic.baud)) + 1;

        /* set 8 bit word length and wake idle line */
        CLEAR_BIT(DEV->UART->CR1, USART_CR1_M | USART_CR1_WAKE);

        /* set parity */
        switch (config->basic.parity) {
        case UART_PARITY__OFF:
                CLEAR_BIT(DEV->UART->CR1, USART_CR1_PCE | USART_CR1_M);
                break;
        case UART_PARITY__EVEN:
                CLEAR_BIT(DEV->UART->CR1, USART_CR1_PS);
                SET_BIT(DEV->UART->CR1, USART_CR1_PCE | USART_CR1_M);
                break;
        case UART_PARITY__ODD:
                SET_BIT(DEV->UART->CR1, USART_CR1_PS);
                SET_BIT(DEV->UART->CR1, USART_CR1_PCE | USART_CR1_M);
                break;
        }

        /* transmitter enable */
        if (config->basic.tx_enable) {
                SET_BIT(DEV->UART->CR1, USART_CR1_TE);
        } else {
                CLEAR_BIT(DEV->UART->CR1, USART_CR1_TE);
        }

        /* receiver enable */
        if (config->basic.rx_enable) {
                SET_BIT(DEV->UART->CR1, USART_CR1_RE);
        } else {
                CLEAR_BIT(DEV->UART->CR1, USART_CR1_RE);
        }

        /* FIFO enable */
        #if defined(USART_CR1_FIFOEN)
        SET_BIT(DEV->UART->CR1, USART_CR1_FIFOEN);
        #endif

        /* enable LIN if configured */
        if (config->basic.mode == UART_MODE__LIN) {
                SET_BIT(DEV->UART->CR2, USART_CR2_LINEN);
        } else {
                CLEAR_BIT(DEV->UART->CR2, USART_CR2_LINEN);
        }

        /* configure stop bits */
        if (config->basic.stop_bits == UART_STOP_BIT__1) {
                CLEAR_BIT(DEV->UART->CR2, USART_CR2_STOP);
        } else {
                CLEAR_BIT(DEV->UART->CR2, USART_CR2_STOP);
                SET_BIT(DEV->UART->CR2, USART_CR2_STOP_1);
        }

        /* clock configuration (synchronous mode) */
        CLEAR_BIT(DEV->UART->CR2, USART_CR2_CLKEN | USART_CR2_CPOL | USART_CR2_CPHA | USART_CR2_LBCL);

        /* LIN break detection length */
        if (config->LIN_break_bits == UART_LIN_BREAK__10_BITS) {
                CLEAR_BIT(DEV->UART->CR2, USART_CR2_LBDL);
        } else {
                SET_BIT(DEV->UART->CR2, USART_CR2_LBDL);
        }

        /* hardware flow control */
        if (config->basic.features & UART_FEATURE__HARDWARE_FLOW_CTRL) {
                SET_BIT(DEV->UART->CR3, USART_CR3_CTSE | USART_CR3_RTSE);
        } else {
                CLEAR_BIT(DEV->UART->CR3, USART_CR3_CTSE | USART_CR3_RTSE);
        }

        /* configure single wire mode */
        if (config->basic.features & UART_FEATURE__SINGLE_WIRE) {
                SET_BIT(DEV->UART->CR3, USART_CR3_HDSEL);
        } else {
                CLEAR_BIT(DEV->UART->CR3, USART_CR3_HDSEL);
        }

        /* enable RXNE interrupt */
        SET_BIT(DEV->UART->CR1, USART_CR1_RXNEIE);

